---
kind: method
id: M:Autodesk.Revit.DB.ReferenceArray.GetEnumerator
source: html/376d41c4-c027-86b6-489d-9b25cac61c5c.htm
---
# Autodesk.Revit.DB.ReferenceArray.GetEnumerator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the array.